CURRENT_TASK_ALREADY_HAS_SCORE = "Задача, за которую выставляется оценка, уже имеет оценку"
CURRENT_TASK_HASNT_EXECUTOR = "Задача, за которую выставляется оценка, не имеет назначенного исполнителя."
CURRENT_TASK_WILL_BE_DONE_STATUS = "Задача, за которую выставляется оценка, должна быть в статусе выполнена."


SENT_INVALID_FORMAT = "Передан неверный формат. Ожидаем число."


NO_TASK = "Нет задач, соответствующих указанному запросу."
NO_WORKER = "Нет сотрудников, соответствующих указанному запросу."
NO_TEAM = "Нет команд, соответствующих указанному запросу."
NO_COMMENT = "Нет комментариев, соответствующих указанному запросу."
NO_EVALUATION = "Нет оценок, соответствующих указанному запросу."
NO_MEETING = "Нет встреч, соответствующих указанному запросу."

NO_VALID_STRING = "Неверная строка."
NOT_VALID_TOKEN_FOR_ANY_TOKEN_TYPE = "Предоставленный токен недействителен ни для одного типа токена."

NO_ACTIVE_ACCOUNT = "Ни одной активной учетной записи не найдена"

REQUIRED_FIELD = "Обязательное поле."

TOKEN_BLACKLISTED = "Токен в черном списке."
TOKEN_IS_INVALID = "Токен является недействительным."


VALIDATION_ERROR_DESCRIPTION = "Ошибка валидации"
NOT_FOUND_DESCRIPTION = "Объект не найден"
FORBIDDEN_DESCRIPTION = "Доступ запрещен"
CONFLICT_DATA = "Конфликт данных"
UNAUTHORIZED_REQUEST = "Несанкционированный запрос"

FORBIDDEN_403_RUSSIAN = "У вас недостаточно прав для выполнения этого действия."
FORBIDDEN_403_DESCRIPTION = "Доступ запрещен."

NO_TASK_COMM_TEXT = "Нет задач/комментариев, соответствующих указанному запросу."
NO_TASK_EVAL_TEXT = "Нет задач/оценок, соответствующих указанному запросу."

VALUE_LE_FIVE = "Убедитесь, что это значение меньше либо равно 5."