CURRENT_TASK_ALREADY_HAS_SCORE = "Задача, за которую выставляется оценка, уже имеет оценку"
CURRENT_TASK_HASNT_EXECUTOR = "Задача, за которую выставляется оценка, не имеет назначенного исполнителя."
CURRENT_TASK_WILL_BE_DONE_STATUS = "Задача, за которую выставляется оценка, должна быть в статусе выполнена."


SENT_INVALID_FORMAT = "Передан неверный формат. Ожидаем число."


NO_TASK = "Нет задач, соответствующих указанному запросу."
NO_WORKER = "Нет сотрудников, соответствующих указанному запросу."
NO_TEAM = "Нет команд, соответствующих указанному запросу."
NO_COMMENT = "Нет комментариев, соответствующих указанному запросу."
NO_EVALUATION = "Нет оценок, соответствующих указанному запросу."
NO_MEETING = "Нет встреч, соответствующих указанному запросу."

NO_VALID_STRING = "Неверная строка."
NOT_VALID_TOKEN = "Предоставленный токен недействителен ни для одного типа токена."

NO_ACTIVE_ACCOUNT = "No active account found with the given credentials"