CURRENT_TASK_ALREADY_HAS_SCORE = "Задача, за которую выставляется оценка, уже имеет оценку"
CURRENT_TASK_HASNT_EXECUTOR = "Задача, за которую выставляется оценка, не имеет назначенного исполнителя."
CURRENT_TASK_WILL_BE_DONE_STATUS = "Задача, за которую выставляется оценка, должна быть в статусе выполнена."


SENT_INVALID_FORMAT = "Передан неверный формат. Ожидаем число."


NO_TASK = "Нет задач, соответствующих указанному запросу."
NO_WORKER = "Нет сотрудников, соответствующих указанному запросу."
NO_TEAM = "Нет команд, соответствующих указанному запросу."
NO_COMMENT = "Нет комментариев, соответствующих указанному запросу."
NO_EVALUATION = "Нет оценок, соответствующих указанному запросу."
NO_MEETING = "Нет встреч, соответствующих указанному запросу."

NO_VALID_STRING = "Неверная строка."
NOT_VALID_TOKEN_FOR_ANY_TOKEN_TYPE = "Предоставленный токен недействителен ни для одного типа токена."

NO_ACTIVE_ACCOUNT = "Ни одной активной учетной записи не найдена"

REQUIRED_FIELD = "Обязательное поле."

TOKEN_BLACKLISTED = "Токен в черном списке."
TOKEN_IS_INVALID = "Токен является недействительным."


VALIDATION_ERROR_DESCRIPTION = "Ошибка валидации"
NOT_FOUND_DESCRIPTION = "Объект не найден"
FORBIDDEN_DESCRIPTION = "Доступ запрещен"
CONFLICT_DATA = "Конфликт данных"
UNAUTHORIZED_REQUEST = "Несанкционированный запрос"

FORBIDDEN_403_RUSSIAN = "У вас недостаточно прав для выполнения этого действия."
FORBIDDEN_403_DESCRIPTION = "Доступ запрещен."

NO_TASK_COMM_TEXT = "Нет задач/комментариев, соответствующих указанному запросу."
NO_TASK_EVAL_TEXT = "Нет задач/оценок, соответствующих указанному запросу."

VALUE_LE_FIVE = "Убедитесь, что это значение меньше либо равно 5."
DEADLINE_NOT_WILL_BE_PAST = "Дэдлайн не может быть в прошлом."
WRONG_FORMAT_MUST_BE_INT = "Передан неверный формат. Ожидаем число."

TASK_UPDATE_CONFLICT = "Ошибка. Нельзя изменить статус для оцененной и завершенной задачи."
EVALUATION_CREATE_CONFLICT = "Задача, за которую выставляется оценка, уже имеет оценку"

INVALID_PASSWORD = "Неправильный пароль."
TEAM_WORKER_CONFLICT = "Конфликт. Сотрудники ['mi47sav4@gmail.com'], добавляемые в команду, уже состоят в других командах"
WRONG_PARAM_DONE = "Парамтер 'done' может быть 0 или 1"
MEETING_WORKER_CONFLICT_DATETIME = "mike@gmail.com уже имеет встречу на дату: 2025-07-05 13:31:00+00:00"